tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "px4/px4"
tap "teamookla/speedtest"
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Rainbows and unicorns in your console!
brew "lolcat"
# Scalable distributed version control system
brew "mercurial"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP/2 C Library
brew "nghttp2"
# Cross-platform library for real-time MIDI I/O
brew "portmidi"
# Tool Command Language
brew "tcl-tk"
# Python interface to Tcl/Tk
brew "python-tk@3.9"
# Low-level access to audio, keyboard, mouse, joystick and graphics
brew "sdl"
# Image file loading library
brew "sdl_image"
# Sample multi-channel audio mixer library
brew "sdl_mixer"
# Library for using TrueType fonts in SDL applications
brew "sdl_ttf"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# SDL MPEG Player Library
brew "smpeg"
# MIPS32 simulator
brew "spim"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Internet file retriever
brew "wget"
# GNU Embedded Toolchain for ARM
brew "px4/px4/gcc-arm-none-eabi"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
cask "background-music"
# Text editor
cask "emacs"
